PANDAS SON DERS

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('ornek_ogrenciler.csv')

In [4]:
df

,total_bill,sex,smoker,day,time,price_per_person,Player_Name
0,19.81,Female,No,Sun,Dinner,3.45,Christy Cunningham
1,16.99,Male,No,Sun,Dinner,3.25,Douglas Tucker
2,21.50,Male,No,Sat,Dinner,4.75,Nathaniel Harris
3,23.45,Female,No,Sat,Dinner,5.00,Tonya Carter
4,29.00,Male,Yes,Sun,Dinner,4.00,Michael Avila
5,18.99,Female,No,Sat,Dinner,2.50,Monica Sanders

In [7]:
simpleDf= pd.DataFrame(data=[[1,2,3,4],[3,2,5,3],[1,2,3,4],[4,1,6,4]], index=['a','b','c','d'])

In [8]:
simpleDf

   0  1  2  3
a  1  2  3  4
b  3  2  5  3
c  1  2  3  4
d  4  1  6  4

In [13]:
simpleDf.duplicated()   # burada aynı verilere sahip olanları tespit ederiz inplace=True dersek kalıcı veri olur

a    False
b    False
c     True
d    False
dtype: bool

In [17]:
simpleDf.drop_duplicates()  # burada diyorum ki aynı olan satırları drop et düşür

   0  1  2  3
a  1  2  3  4
b  3  2  5  3
d  4  1  6  4

In [18]:
simpleDf.drop_duplicates(keep='last')   # burada da diyorum ki duplicate olan ilk veriyi sil

   0  1  2  3
b  3  2  5  3
c  1  2  3  4
d  4  1  6  4

In [19]:
  #  amaç: total_bill değeri 10 ile 20 arasındaki satırları getirin

In [20]:
df['total_bill'].between(10,20)

0     True
1     True
2    False
3    False
4    False
5     True
Name: total_bill, dtype: bool

In [22]:
df[~df.total_bill.between(10,20)]     #  total_bill değeri 10 ile 20 arasında olmayan satırları getirin

   total_bill     sex smoker  day    time  price_per_person       Player_Name
2       21.50    Male     No  Sat  Dinner              4.75  Nathaniel Harris
3       23.45  Female     No  Sat  Dinner              5.00      Tonya Carter
4       29.00    Male    Yes  Sun  Dinner              4.00     Michael Avila

In [23]:
df[df.total_bill.between(10,20)]     #  total_bill değeri 10 ile 20 arasında olan satırları getirin

,total_bill,sex,smoker,day,time,price_per_person,Player_Name
0,19.81,Female,No,Sun,Dinner,3.45,Christy Cunningham
1,16.99,Male,No,Sun,Dinner,3.25,Douglas Tucker
5,18.99,Female,No,Sat,Dinner,2.50,Monica Sanders

In [27]:
df[df.total_bill.between(10,20,inclusive='left')]   # bu da soldaki dahil olsun eşit büyük anlamında

,total_bill,sex,smoker,day,time,price_per_person,Player_Name
0,19.81,Female,No,Sun,Dinner,3.45,Christy Cunningham
1,16.99,Male,No,Sun,Dinner,3.25,Douglas Tucker
5,18.99,Female,No,Sat,Dinner,2.50,Monica Sanders

In [31]:
df.nlargest(3,'price_per_person')  # en büyük tiplere göre sırala

   total_bill     sex smoker  day    time  price_per_person       Player_Name
3       23.45  Female     No  Sat  Dinner              5.00      Tonya Carter
2       21.50    Male     No  Sat  Dinner              4.75  Nathaniel Harris
4       29.00    Male    Yes  Sun  Dinner              4.00     Michael Avila

In [33]:
df.sort_values('price_per_person', ascending=False).head()  # ascending false demek dde küçğktten değil büyükten küçüğe yp demek

,total_bill,sex,smoker,day,time,price_per_person,Player_Name
3,23.45,Female,No,Sat,Dinner,5.00,Tonya Carter
2,21.50,Male,No,Sat,Dinner,4.75,Nathaniel Harris
4,29.00,Male,Yes,Sun,Dinner,4.00,Michael Avila
0,19.81,Female,No,Sun,Dinner,3.45,Christy Cunningham
1,16.99,Male,No,Sun,Dinner,3.25,Douglas Tucker

In [35]:
df.nsmallest(columns='price_per_person', n=3)

,total_bill,sex,smoker,day,time,price_per_person,Player_Name
5,18.99,Female,No,Sat,Dinner,2.50,Monica Sanders
1,16.99,Male,No,Sun,Dinner,3.25,Douglas Tucker
0,19.81,Female,No,Sun,Dinner,3.45,Christy Cunningham

In [37]:
df.sample(4)

   total_bill     sex smoker  day    time  price_per_person       Player_Name
5       18.99  Female     No  Sat  Dinner              2.50    Monica Sanders
4       29.00    Male    Yes  Sun  Dinner              4.00     Michael Avila
2       21.50    Male     No  Sat  Dinner              4.75  Nathaniel Harris
3       23.45  Female     No  Sat  Dinner              5.00      Tonya Carter

MİSSİNG VALUES(EKSİK VERİLER)

In [38]:
 # 3.kurda öğreneceğimiz makine öğrenmesi algoritmaları çoğu missing valuelarla çalışmaz.biz uğraşıcaz handle etmemiz gerekiyor
 # missing value kavramı eksik veri anlamına gelir datamız içindekii değeri bilinmeyen verileri ifade eder
 # missing valuelar farklı formatlarda olabilir

In [40]:
np.nan  # eksik veri bilinmeyen veri en sık karşılacağımız veri tipi

nan

In [41]:
pd.NA

In [42]:
pd.NaT

NaT

In [43]:
5==5

True

In [47]:
np.nan==np.nan  # değerini bilmediğim bir şey değerini bilmediğim bir şeye eşittir diyemeyiz

False

In [112]:
df=pd.read_csv("movie_scores.csv")
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [54]:
df.isna() # değeri oolmayanları true diye döndürür

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   first_name        4 non-null      object
 1   last_name         4 non-null      object
 2   age               4 non-null      float64
 3   sex               4 non-null      object
 4   pre_movie_score   3 non-null      float64
 5   post_movie_score  3 non-null      float64
dtypes: float64(3), object(3)
memory usage: 372.0+ bytes

In [57]:
df.isna().sum() # kaç tane nan var

first_name          1
last_name           1
age                 1
sex                 1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [59]:
df.notna()  # not non olmayan

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [62]:
df[df.pre_movie_score.notna()]  #  pre_movie_score pre_movie_score da nan olmayan elemanları getirmek

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [63]:
 #  amaç post_moivie score u nan olanları getir

In [64]:
df[df['post_movie_score'].isna()]

  first_name last_name   age  sex  pre_movie_score  post_movie_score
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN

In [65]:
 #   amaç: pre movie score u nan olam age sütunu nan olmayan

In [67]:
(df['pre_movie_score'].isna()) & (df['age'].notna())

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [68]:
df[(df['pre_movie_score'].isna()) & (df['age'].notna())]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

MİSSİNG VALUELARLA YAPILACAK 3 YOL VARDIR

1.YOL DOKUNMADAN BIRAKABİLRİZ

2.DROP EDEBİLİRİZ (SATIR VEYA SÜTUN BAZLI)

3.MANTIKLI BİR ŞEKİLDE DOLDURABİLİRİZ

In [70]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [71]:
 # 2.yol drop etme işlemi dropna() methodu ile

In [73]:
df.dropna()  # burada diyorum ki nan olan her satır gitsin

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [74]:
df.dropna(how='any')  # burada diyorum ki 1 nan olan satır varsa bile gitsin nan olan hiçbir satır gelmesin drop et
# ama buna gerek yok dropna() ile aynı

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [76]:
df.dropna(how='all')  # burada diyorum ki satırın hepsi nan ise getirme

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [78]:
df.dropna(thresh=1) # 1 tane nan olmayan bile varsa o satırı tut all gibi

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [80]:
df.dropna(thresh=5) # sağlam 5 veri olsun demek

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [82]:
df.dropna(axis=1) # sütünlar da 1 nan bile varsa sil

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [83]:
df.dropna(axis=1, thresh=4)

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

In [84]:
# 3.yol : fill the data(veriyi doldur)

In [85]:
df.dropna(how='all', inplace=True)

In [86]:
df

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [113]:
df.pre_movie_score.fillna(9.5)

0    8.0
1    9.5
2    9.5
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [114]:
# df.pre_movie_score.fillna(df['pre_movie_score'].mean(), inplace=True)

In [109]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              7.0               NaN
2       Hugh   Jackman  51.0    m              7.0               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0